In [1]:
import pandas as pd
import numpy as np
from scipy import stats
from scipy.stats import norm

In [2]:
data=pd.read_csv('LabTAT.csv')

In [3]:
data.head(5)

   Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
0        185.35        165.53        176.70        166.13
1        170.49        185.91        198.45        160.79
2        192.77        194.92        201.23        185.18
3        177.33        183.00        199.61        176.42
4        193.41        169.57        204.63        152.60

In [4]:
data.tail(7)

     Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
113        154.21        193.79        197.88        192.23
114        145.89        175.16        203.39        139.34
115        178.49        170.66        193.80        172.68
116        176.08        183.98        215.25        177.64
117        202.48        174.54        203.99        170.27
118        182.40        197.18        194.52        150.87
119        182.09        215.17        221.49        162.21

In [14]:
data.value_counts()

Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
138.30        176.63        193.08        128.93          1
143.52        168.20        213.18        124.06          1
186.22        182.17        189.98        167.83          1
185.87        194.24        201.17        149.96          1
185.42        205.27        177.62        172.72          1
                                                         ..
171.65        142.38        187.60        167.07          1
171.64        188.49        202.95        167.62          1
171.41        185.67        180.35        145.40          1
170.61        169.11        203.24        165.95          1
216.39        193.28        177.76        161.42          1
Length: 120, dtype: int64

In [8]:
p_value=stats.f_oneway(data.iloc[:,0],data.iloc[:,1],data.iloc[:,2],data.iloc[:,3])
p_value

F_onewayResult(statistic=118.70421654401437, pvalue=2.1156708949992414e-57)

In [9]:
p_value[0]

118.70421654401437

Inference: as ( Î± = 0.05) (p-value=0); Reject the Null Hypothesis, which states that there is variance or a difference in the average Turn Around Time (TAT) of the reports from the laboratories on their preferred list because at least one sample TAT population mean is different.